АгрегаторМаркетплейсов/src/Documents/ПродажиМаркетплейса/ПродажиМаркетплейса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПродажиМаркетплейса</name>
  <registerRecords>AccumulationRegister.ПродажиМаркетплейсов</registerRecords>
  <attributes>
    <name>Маркетплейс</name>
    <type>
      <types>CatalogRef.Маркетплейсы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Товары</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаПродажи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПродажи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комиссия</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Себестоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧистаяПрибыль</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АгрегаторМаркетплейсов/src/AccumulationRegisters/ПродажиМаркетплейсов/ПродажиМаркетплейсов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПродажиМаркетплейсов</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаПродажи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКомиссии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Себестоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЧистаяПрибыль</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Товары</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Маркетплейс</name>
    <type>
      <types>CatalogRef.Маркетплейсы</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

АгрегаторМаркетплейсов/src/Documents/ПродажиМаркетплейса/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

    Если Не ЗначениеЗаполнено(Маркетплейс) Тогда
        Сообщить("Не выбран маркетплейс.");
        Отказ = Истина;
        Возврат;
	КонецЕсли;   
	
	Если Товары.Количество() = 0 Тогда
        Сообщить("Не заполнена табличная часть Товары.");
        Отказ = Истина;
        Возврат;
    КонецЕсли;

    Если Маркетплейс.КомиссияПроцент < 0 Или Маркетплейс.КомиссияПроцент > 100 Тогда
        Сообщить("Процент комиссии маркетплейса должен быть от 0 до 100.");
        Отказ = Истина;
        Возврат;
    КонецЕсли;

    Движения.ПродажиМаркетплейсов.Записывать = Истина;

    Для Каждого СтрокаТовары Из Товары Цикл

        Если Не ЗначениеЗаполнено(СтрокаТовары.Товар) Тогда
            Сообщить("Не заполнен товар в строке документа.");
            Отказ = Истина;
            Возврат;
        КонецЕсли;

        Если СтрокаТовары.Количество <= 0 Тогда
            Сообщить("Количество должно быть больше нуля.");
            Отказ = Истина;
            Возврат;
        КонецЕсли;

        Если СтрокаТовары.ЦенаПродажи < 0 Тогда
            Сообщить("Цена продажи не может быть отрицательной.");
            Отказ = Истина;
            Возврат;
        КонецЕсли;
             
        Если СтрокаТовары.Товар.Себестоимость < 0 Тогда
            Сообщить("Себестоимость товара не может быть отрицательной.");
            Отказ = Истина;
            Возврат;
        КонецЕсли;
      
		СуммаПродажи = СтрокаТовары.Количество * СтрокаТовары.ЦенаПродажи;
		СебестоимостьСтроки = СтрокаТовары.Количество * СтрокаТовары.Товар.Себестоимость;
		
		КомиссияПроцент = Маркетплейс.КомиссияПроцент;
		КомиссияСтроки = Окр(СуммаПродажи * КомиссияПроцент / 100, 2);
		
		ЧистаяПрибыльСтроки = СуммаПродажи - КомиссияСтроки - СебестоимостьСтроки;
		
		Движение = Движения.ПродажиМаркетплейсов.Добавить();
		
		Движение.Период = Дата;
		Движение.Товар = СтрокаТовары.Товар;
		Движение.Маркетплейс = Маркетплейс;
		
		Движение.Количество = СтрокаТовары.Количество;
		Движение.СуммаПродажи = СуммаПродажи;
		Движение.СуммаКомиссии = КомиссияСтроки;
		Движение.Себестоимость = СебестоимостьСтроки;
		Движение.ЧистаяПрибыль = ЧистаяПрибыльСтроки;

    КонецЦикла;

КонецПроцедуры
